// მარტივი მისალმების ფუნქცია
// შექმენით arrow function, რომელიც იღებს ერთი პარამეტრს (სახელი) და აბრუნებს „გამარჯობა, [სახელი]!“. თუ პარამეტრი არ არის მოცემული, გამოიყენეთ "მაყურებელი" როგორც დეფოლტი.
const greet = (name = "guest") => `hello, ${name}!`;

console.log(greet());
console.log(greet("ani"));
// ---

// ორი რიცხვის ჯამი
// შექმენით arrow function, რომელიც იღებს ორი პარამეტრს (a, b) და აბრუნებს მათ ჯამს. თუ პარამეტრები არ არის მოცემული, გამოიყენეთ 0 და 5 როგორც დეფოლტი მნიშვნელობები.
const add = (a = 0, b = 5) => a + b;

console.log(add(1, 2));
console.log(add());
// ---

// მაქსიმალური რიცხვი
// შექმენით arrow function, რომელიც იღებს ორი რიცხვს და აბრუნებს მეტს მათ შორის. თუ პარამეტრები არ არის მოცემული, გამოიყენეთ 10 და 20 როგორც დეფოლტი მნიშვნელობები.
const greater = (a = 10, b = 20) => Math.max(a, b);

console.log(greater(1, 2));
console.log(greater());
// ---

// სამი რიცხვის გამრავლება
// შექმენით arrow function, რომელიც იღებს სამი პარამეტრს და აბრუნებს მათ გამრავლებას. თუ პარამეტრები არ არის მოცემული, გამოიყენეთ 1, 2 და 3 როგორც დეფოლტი მნიშვნელობები.
const product = (a = 1, b = 2, c = 3) => a * b * c;

console.log(product(2, 2, 10));
console.log(product());
// ---

// ფარმაცევტული ფასის გამოთვლა
// შექმენით arrow function, რომელიც იღებს ორ პარამეტრს (ფასს და გადასახადს) და აბრუნებს საბოლოო ფასს (ფასი + გადასახადი). თუ გადასახადი არ არის მოცემული, გამოიყენეთ 5% როგორც დეფოლტი.
const final_price = (price, bill = 0.05) => price + price * bill;

console.log(final_price(100, 0.1));
console.log(final_price(100));
// ---

// დაბოლოების სიმრავლე
// შექმენით arrow function, რომელიც იღებს ტექსტს და რიცხვს და აბრუნებს ტექსტის გამეორებას მოცემული რიცხვის რაოდენობის მიხედვით. თუ რიცხვი არ არის მოცემული, გამოიყენეთ 3 როგორც დეფოლტი.
const dublicate = (text, rep = 3) => text.repeat(rep);

console.log(dublicate("ani", 2));
console.log(dublicate("ani"));
// ---

// რიცხვების ამოწმება
// შექმენით arrow function, რომელიც იღებს ორი რიცხვს და აბრუნებს true თუ პირველი რიცხვი მეტია მეორეზე. თუ არ არის პარამეტრები, გამოიყენეთ 5 და 10 როგორც დეფოლტი.
const isGreater = (a = 5, b = 10) => a > b;

console.log(isGreater(4, 2));
console.log(isGreater());
// ---

// პირადი ჩამონათვალი
// შექმენით arrow function, რომელიც იღებს ობიექტს, რომელშიც არის სახელი, ასაკი და ქალაქი. თუ რომელიმე პარამეტრი არ არის მოცემული, გამოიყენეთ მაია, 25 და თბილისი როგორც დეფოლტი მნიშვნელობები. ფუნქცია უნდა დააბრუნოს სტრინგი, რომელიც შეიცავს შემდეგ შინაარსს: "გამარჯობა, მე ვარ [სახელი], [ასაკი] წლის და მცხოვრები ვარ [ქალაქი]-ში."
const greetings = (obj = {name: "მაია", age: 25, city: "თბილისი"}) => `გამარჯობა, მე ვარ ${obj.name}, ${obj.age} წლის და მცხოვრები ვარ ${obj.city}-ში.`;

console.log(greetings({name: "ანი", age: 18, city: "თბილისი"}));
console.log(greetings());
// ---

// რიცხვების სერია
// შექმენით arrow function, რომელიც იღებს დასაწყისის რიცხვს, ბოლოს რიცხვს და ნაბიჯის ზომას. ფუნქცია უნდა დააბრუნოს ყველა რიცხვი იმ ინტერვალებში, მიცემული ნაბიჯის ზომით. თუ რომელიმე პარამეტრი არ არის მოცემული, გამოიყენეთ 1, 10 და 1 როგორც დეფოლტი.
const range = (start = 1, end = 10, step = 1) => {
    result = [];
    for(let i = start; i < end; i+= step){
        result.push(i);
    };
    return result;
};

console.log(range(1, 10, 2));
console.log(range());
// ---

// ობიექტის მნიშვნელობების გაერთიანება
// შექმენით arrow function, რომელიც იღებს ობიექტებს (ორ ან მეტს) და აბრუნებს მათ გაერთიანებულ მნიშვნელობებს (რაც იმას ნიშნავს, რომ ყველა ობიექტის ყველა მახასიათებელი გაერთიანდება ერთ ობიექტში). თუ არ არის ობიექტი გადმოცემული, გამოიყენეთ ცარიელი ობიექტი {} როგორც დეფოლტი.
const joinObjs = (objs = [{}]) => {
    result = {};
    for(let obj of objs){
        for(let key in obj){
            result[key] = obj[key];
        }
    }
    return result
}

console.log(joinObjs([{name:"ani"}, {surname: "razmi", age: 18}]))
console.log(joinObjs())