//1----------------------------------------------------
function print() {
    console.log("ani razmadze")
};

print();

//შევქმენი print ფუნქცია, რომელსაც გამოაქ ჩემი სახელი და გვარი კონსოლში და შემგომ გამოვიძახე ის

//2----------------------------------------------------
function message() {
    alert("know me")
};

//შევქმენი ფუნქცია სახელად message, რომელსაც გამოაქ გამაფრთხილებელი მესიჯი როდესაც ვიძახებთ.

//3----------------------------------------------------
//ჯავასკრიპტში ფუნქციის შესაქმნელად გვჭირდება თავდაპირველად დავწეროთ function ქეივორდი, რომელიც გვაძლევს იმის საშუალებას რომ შევქმნათ ახალი ფუნქცია.შემდეგ ვწერთ ფუნქციის სახელს და ბოლოსვწერთ კოდის ბლოკს რომელიც უნდა გაიშვას მოცემული ფუნქციის გამოძახებისას.

//ჯავასკრიპტში კოდის ბლოკის დაწერისას არაა აუცილებელი იდენტაცია რომ პროგრამამ სწორად იმუშაოს, ხოლო ფითონში ეს აუცილებელია.

//4----------------------------------------------------
//ინდენტაციის გამოყენება - ინდენტაციით ჩვენ შეგვიძლია გამოვყოთ კოდის ბლოკები ერთმანეთისგან და უფრო მარტივად წასაკითხი გავხადოთ ამგვარად ჩვენი კოდი.
//ექტერნალ ჯავასკრიპტის გამოყენება - ექტერნალ ჯავასკრიპტი გულისხმობს ჯავასკრიპტის კოდის ცალკე ფაილში დაწერას, რის დახმარებითაც ჩვენ შეგვიძლია ავირიდოთ თავიდან, html და js კოდების ერთმანეთში არევა.
//კომენტარების გამოყება - კომენტარებით ჩვენ შეგვიძლია ავხსნათ თუ რას შვება ესა თუ ის კოდი და ამგავრად კოდი უფრო მარტივად წასაკითხი გავხადოთ.

//5----------------------------------------------------
let name = prompt("enter your name: ");
let surname = prompt("enter your surname: ");
console.log("registered")
