// 1)
// ახსენით რა განსხვაებაა ასოციაციურ მასივსა და ობიექტს შორის
// ასოციაციური მასივი - მასივი რომელშიც ინდექსების მაგვივრად გვაქ სტრინგები.
// ობიექტი - ინფორმაციის ტიპი, რომელშიც მონაცემებს ლოკაციები აქვთ მითითებული სახელებით(სტრინგებით არა).

// 2)
// შექმენით ასოციაციური მასივი და სცადეთ მასზე აქამდე ნასწავლი 3 მასივის მეთოდის გამოყენება
let arr = [];
// arr["name"] = "ani"
// arr.shift()
// arr.push("ani")
// arr.delete("name")
// console.log(arr)

// 3)
// გამოიყენეთ ყველა შესწავლილი Math ობიექტის მეთოდი და გააკეთეთ თითო თითო მაგალითი, ასევე კომენტარების საშვალებით ახსენით თუ რას აკეთებს თითოეული
console.log(Math.round(3.5)) //ამრგვალებს ათწილადს, უახლოეს მთელ რიცხვამდე
console.log(Math.PI) //გვაძლევს პი რიცხვს
console.log(Math.floor(3.5)) // აშორებს ათწილადს წერტილის შემდეგ ნაწილს
console.log(Math.trunc(3.5)) // აშორებს ათწილადს წერტილის შემდეგ ნაწილს
console.log(Math.random()) // გვაძლევს შემთხვევით რიცხვს 0-დან 1-მდე
console.log(Math.sqrt(9)) // ამოყავს ფესვი რიცსვიდან
console.log(Math.pow(3, 3)) // აყავს რიცხვი მითითებულ ხარისხში
console.log(Math.ceil(1.009)) // ამრგვალებს რიცხვს მაღლითკენ