#2) გატესტეთ join და replace ფუნქციები, კომენტარებით ახსენით თუ როგორ მუშაობენ

list = ["hbasdb","ahbsdba","ahbdbas"]

print(" ".join(list))

# join() არის ლისტის მეთოდი, რომელიც იღებს ლისტს სტრინგებისგან, ასრულებს ამ სტრინგებს შორის კონკადინაციას და საბოლოოდ გვიბრუნებს ერთ სტრინგს. წერტილის მარცხნივ იწერება სეპარატორი ანუ ის სიმბოლო, რომელიც დაიწერება თითოეულ ელემენტს შორის გაერთიანებულ სტრინგში, ხოლო ფრჩხილებში თავსდება ლისტი რომლის ელემენტებზეც გვინდა მოვახდინოთ კონკადინაცია

print("asdad".replace("d", ""))

# replace() არის სტრინგის მეთოდი, რომელიც ანაცვლებს რაღაც კონკრეტულ ელემენტს სხვა ელემენტით. წერტილის მარჯვნივ იწერება სტრინგი რომლის ელემენტის შეცვლაც გვინდა, ხოლო ფრჩხილებში პირველ არგუმენტად იწერება ელემენტი რომელიც უნდა ჩანაცვლდეს, მეორე კი არგუმენტად იწერება თვითონ ჩამნაცვლებელი