# შექმენით პროგრამა სადაც მომხმარებელი შემოიტანს 5 რიცხვს
# ხოლო ამ 5 რიცხვს შორის გამოიყენეთ ყველა არითმეტიკული ოპერაცია (// და %_იც)        
# საბოლოოდ დაბეჭდეთ შედეგები ტერმინალში 
# + ახსენით თითოეული ნაწილი კოდის რატომ დაწერეთ კონკრეტული ხაზი და რას აკეთებს.



# ითხოვს მომხმარებლისგან input-ს და გარდაქმნის ჩაწერილ ინფორმაციას ინტეჯერად,
# რათა შემდგომ მოცემულ მნიშვნელობეზე  შევძლოთ არითმეტიკური ოპერაციების შესრულება.

num1 = int(input("enter number 1: ")) 
num2 = int(input("enter number 2: "))
num3 = int(input("enter number 3: "))
num4 = int(input("enter number 4: "))
num5 = int(input("enter number 5: "))


# მომხმარებლის მიერ შემოტანილ რიცხვებს შორის ასრულებს ყველა არითმეტიკულ ოპერაციას

print(num1 + num2)
print(num1 - num3)
print(num1 / num4)
print(num4 // num5)
print(num3 % num4)
print(num5 ** num1)
print(num2 * num4)