# 1) შემოგდით n და n ზომის მასივი. დაბეჭდეთ მასივის ორი უდიდესი ელემენტის ჯამი.
#    მაგ 5, 18 12 40 1 19
#    პასუხია 40+19=59.
def greatest_sum(nums):
    return sorted(nums)[-1] + sorted(nums)[-2]

print(greatest_sum([1,2,4,32,7,0]))

# 2) შემოგდით n და n ზომის მასივი. თქვენი ამოცანაა იპოვოთ მასივში ყველაზე ბოლოს გამეორებული ელემენტი და დაბეჭდოთ იგი. თუ  ასეთი ელემენტი არ არსებობს დაბეჭდეთ რომ მასივში არცერთი ელემენტი არ მეორდება
# მაგ : 5, 1 3 4 1 3 12 
# პასუხია 3 (მასივში გამიმეორდა 1-იანი და 3-იანი თუმცა რადგან 3 უფრო გვიან გამეორდა ეგაა საძებნი ელემენტიც)

def least_repeated_num(arr):
    repeatedEl = "there is no repeated element"
    for e in arr:
        if(arr.count(e) > 1):
            repeatedEl = e
    return repeatedEl

print(least_repeated_num([5,1,3,4,1,3,12]))

# 3) შემოდის n და n ზომის მასივი. თქვენი  ამოცანაა თითოეული ელემენტისთვის დაბეჭდოთ მის მარცხნივ მყოფ ელემენტებს შორის რამდენზე მეტია იგი.
# მაგ  n=5, 3 2 6 5 1

def count_is_greater_or_not(nums):
    result = []
    
    for i in range(len(nums)):
        counter = 0
        for j in range(i, -1, -1):
            if nums[i] > nums[j]:
                counter += 1
        result.append(counter)    
    return result

print(count_is_greater_or_not([3, 2, 6, 5, 1]));

# პასუხია 0,0,2,2,0  (3-ის წინ არცერთი ელემეტნია, 2ის წინ 3ია თუმცა არაა მასზე მეტი , 6ის წინ 3 და 2  წერია რადგან ორივეზე მეტია დაიბეჭდება 2, 5ის 3 2 6 წერია ამათგან 2 მათგანზე მეტია აქაც 2 და ბოლოს 1იანი არცერთზე მეტი არაა და დაიბეჭდება 0 )